package com.example.wattercount.state

import com.example.wattercount.R
import com.example.wattercount.models.Article

val news = mutableListOf (
      Article(
          "Дикий сушняк накрыл нас",
          R.drawable.water_drink2,
          "Распространенная рекомендация выпивать 2 л воды в день — это гениально спланированная рекламная кампания по потреблению воды или забота о здоровье? Если забота, то почему именно 2 л? Мы более чем на две трети состоим из воды, очевидно, что без воды жизнь прекращается. Именно вода является и транспортным средством, и структурообразующим компонентом, и основной средой, в которой происходят сложные биохимические процессы. Другой вопрос — сколько пить воды? Однозначного ответа нет. Количество воды, необходимой человеку, очень индивидуально. Один «размер» не подходит всем, если говорить о пресловутых 2 л. Безусловно, важно не забывать пить воду в течение дня, но не надо ограничивать количество 2, 3, 4 л (по разным рекомендациям). Оптимальная норма, которую уже подтвердили специалисты, — не менее 1,2–1,5 л взрослому человеку при любых условиях. Речь идет о «среднем» случае — без серьезных заболеваний, приема мочегонных препаратов и т. п. Жаркая погода, серьезные тренировочные нагрузки, физический труд, лихорадка увеличивают потребность в воде (за счет дополнительных потерь с потом), прием некоторых лекарств также требует повышенного употребления воды. "
      ),
    Article(
        "А это мой второй заголовок",
        R.drawable.water_drink,
        ""
    )
)